[
  {
    "id": 1,
    "title": "Jairus Ondiegi",
    "image": "./jairo.JPG",
    "post": "Managing Partner",
    "details": "Jairus Ondiegi Otieno is an accomplished Advocate of the High Court of Kenya, renowned for his expertise in dispute resolution. With a solid educational foundation and extensive professional experience, he has established himself as a dedicated and effective legal practitioner. \n\nEducational Background:\n- Bachelor of Laws (LL.B) - Moi University\n- Postgraduate Diploma in Law - Kenya School of Law\n\nProfessional Experience:\n- **Milimani Law Courts**: Jairus has significant experience handling various legal matters, gaining invaluable courtroom experience. His role involved representing clients in civil and criminal cases, drafting legal documents, and providing sound legal advice.\n- **Wangari Ndiragu and Co. Advocates**: At Wangari Ndiragu and Co. Advocates, Jairus honed his skills in dispute resolution, working on complex cases and providing expert legal counsel.\n\nProfessional Affiliations:\n- Law Society of Kenya (LSK)\n- East Africa Law Society (EALS)\n\nSpecializations:\n- Dispute Resolution\n- Civil and Criminal Litigation\n- Legal Research and Drafting\n- Client Representation and Advisory\n\nJairus is committed to providing exceptional legal services with a focus on resolving disputes efficiently and effectively."
  },
  {
    "id": 2,
    "title": "Annete Atuti",
    "image": "./annet.JPG",
    "post": "Associate",
    "details": "Annette Atuti is a distinguished Advocate of the High Court of Kenya, bringing a wealth of experience in both public and private legal practice. \n\nEducational Background:\n- Bachelor of Laws (LL.B) - African Nazarene University\n- Postgraduate Diploma in Law - Kenya School of Law\n\nProfessional Experience:\n- **Independent Policing Oversight Authority (IPOA)**: Annette played a crucial role in overseeing and promoting transparency and accountability within the police service, ensuring adherence to legal and human rights standards.\n- **Kenya Revenue Authority (KRA)**: She applied her legal expertise to tax administration, handling litigation, providing legal advice, and ensuring compliance with regulatory frameworks.\n\nProfessional Skills:\n- Litigation and Dispute Resolution\n- Legal Research and Drafting\n- Regulatory Compliance\n- Human Rights Advocacy\n- Tax Law and Policy\n\nProfessional Affiliations:\n- Law Society of Kenya (LSK)\n- East Africa Law Society (EALS)\n\nAnnette is dedicated to upholding the rule of law and advocating for the rights of her clients."
  },
  {
    "id": 3,
    "title": "Brian Odiwuor",
    "image": "./team.JPG",
    "post": "Associate",
    "details": "Brian Odiwuor is an Advocate of the High Court of Kenya and a seasoned Tax Law Expert.\n\nEducational Background:\n- Bachelor of Laws - University of Nairobi\n- Postgraduate Diploma - Kenya School of Law\n- Certified Public Accountant (CPA-K)\n\nProfessional Experience:\n- **ACTED**: Contributed significantly in tax law advisory and legal compliance.\n- **Bowman’s**: Worked extensively in taxation, regulatory compliance, and litigation.\n\nProfessional Skills:\n- Tax Law and Policy\n- Corporate Legal Advisory\n- Litigation and Regulatory Compliance\n\nProfessional Affiliations:\n- Law Society of Kenya (LSK)"
  },
  {
    "id": 4,
    "title": "Denish Awajo",
    "image": "./me.JPG",
    "post": "ICT Lead",
    "details": "Denish Awajo is an accomplished ICT Lead with a specialized background in Business Information Technology. \n\nEducational Background:\n- Bachelor of Business Information Technology (BBIT) - Technical University of Kenya\n\nProfessional Experience:\n- **National Treasury**: Managed ICT projects, ensuring the security and efficiency of information systems while implementing strategic initiatives to enhance operational effectiveness.\n- **McKinsey & Company - Forward Learning Program**: Developed expertise in leadership, problem-solving, and strategic thinking.\n\nProfessional Skills:\n- Leadership and Management\n- ICT Strategy and Implementation\n- Project Management\n- Business Process Optimization\n\nProfessional Affiliations:\n- Member of the Institute of Administration Management (IAM)\n- McKinsey & Company Forward Learning Program Alumni\n\nDenish is dedicated to leveraging his expertise in business technology to drive organizational success."
  },
  {
    "id": 5,
    "title": "Paul Okoth",
    "image": "./paul.JPG",
    "post": "Administrator",
    "details": "Paul Okoth is a seasoned leader with a multifaceted background. He holds a Mechanical Engineering degree from the Technical University of Mombasa, where he served as the Student Council Secretary-General. Additionally, he earned a Nursing Diploma from Kendu Adventist Hospital, where he was the Student Council President.\n\nPaul is also a corporate MC and a passionate leader who excels in administrative roles, combining technical expertise with strong leadership skills to drive success in various capacities."
  }
]
